In [1]:
import pandas as pd
import numpy as np

In [2]:
#1차원 list 를 dataframe으로 변환
list = [1,2,3,4,5]
df1 = pd.DataFrame(list)
print(type(df1))
print(df1)

<class 'pandas.core.frame.DataFrame'>
   0
0  1
1  2
2  3
3  4
4  5

In [4]:
df1["1열"] = list
df1

   0  1열
0  1   1
1  2   2
2  3   3
3  4   4
4  5   5

In [5]:
df1.columns

Index([0, '1열'], dtype='object')

In [7]:
df2 = df1.rename(columns={0:"0열"})
df2

   0열  1열
0   1   1
1   2   2
2   3   3
3   4   4
4   5   5

In [8]:
#2차원 배열을 데이터프레임으로 만들기
score = [
    ['정약용', 70, 80, 100],
    ['이순신', 90, 80, 60],
    ['이율곡', 50, 100, 100]
    ]

print(type(score))
score

<class 'list'>

[['정약용', 70, 80, 100], ['이순신', 90, 80, 60], ['이율곡', 50, 100, 100]]

In [9]:
df3 = pd.DataFrame(score)
print(type(df3))
df3

<class 'pandas.core.frame.DataFrame'>

     0   1    2    3
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100

In [13]:
df3.columns = ["이름", "국어", "영어", "수학"]
print(df3)
print(df3.shape)
print(df3.index)

    이름  국어   영어   수학
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100
(3, 4)
RangeIndex(start=0, stop=3, step=1)

In [14]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [15]:
df3.describe()

         국어          영어          수학
count   3.0    3.000000    3.000000
mean   70.0   86.666667   86.666667
std    20.0   11.547005   23.094011
min    50.0   80.000000   60.000000
25%    60.0   80.000000   80.000000
50%    70.0   80.000000  100.000000
75%    80.0   90.000000  100.000000
max    90.0  100.000000  100.000000

In [16]:
# dictionary 데이터 프레이임으로 전환
# dic1 = {
#     'col1':[1,2,3,4],
#     'col2':[5,6,7,8]
# }
# n= pd.DataFrame(dic1)

n = pd.DataFrame({
    'col1':['1','2','3','4'],
    'col2':[5,6,7,8]
})
print(n)

  col1  col2
0    1     5
1    2     6
2    3     7
3    4     8

In [17]:
n.info()
n.dtypes
# 숫자 column만 통계자료 생성됨
n.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

           col2
count  4.000000
mean   6.500000
std    1.290994
min    5.000000
25%    5.750000
50%    6.500000
75%    7.250000
max    8.000000

In [18]:
#데이터 type변경 (String -> int), (int -> float)
n_df = n.astype({'col1':int, 'col2':float})
n_df.dtypes
#컬럼을 숫자type으로 변경시 통계자료 생성됨
n_df.describe()

           col1      col2
count  4.000000  4.000000
mean   2.500000  6.500000
std    1.290994  1.290994
min    1.000000  5.000000
25%    1.750000  5.750000
50%    2.500000  6.500000
75%    3.250000  7.250000
max    4.000000  8.000000

In [19]:
#전체컬럼조회
display(n_df)
#컬럼값1개는 대괄호가 1개 필요
display(n_df['col1'])
#컬럼값2개 이상에는 대괄호가 2개 필요
display(n_df[['col1','col2']])

   col1  col2
0     1   5.0
1     2   6.0
2     3   7.0
3     4   8.0

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

   col1  col2
0     1   5.0
1     2   6.0
2     3   7.0
3     4   8.0

In [20]:
# 순회해서 데이터 접근하기 : iteration rows : row 순회함수
for index, row in n_df.iterrows():
    print(row['col1'])

1.0
2.0
3.0
4.0

In [21]:
# 새로운 컬럼을 추가해서 sum값 만들기
n_df
n_df['sum'] = n_df['col1'] + n_df['col2']
n_df

   col1  col2   sum
0     1   5.0   6.0
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [22]:
# 8이상인sum값 구하기
n1_df = n_df[n_df['sum']>= 8]

In [26]:
# index가 빠진상태로  들어간다
n_df[n_df['sum'] >= 8]

   col1  col2   sum
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [28]:
# index 초기화 : 원래 인덱스는 남고, 새로운 초기화된 index 생성됨
n1_df.reset_index()
n1_sum = n1_df['sum']
print(type(n1_sum))
print(n1_sum.shape)
print(n1_sum)

<class 'pandas.core.series.Series'>
(3,)
1     8.0
2    10.0
3    12.0
Name: sum, dtype: float64

In [30]:
# index를 초기화하는 다른방법 : drop=True : 예전 index는 사라지고 새로운 인덱스 생김
n2_df = n_df[n_df['sum']>= 8].reset_index(drop=True)

In [31]:
n2_df

   col1  col2   sum
0     2   6.0   8.0
1     3   7.0  10.0
2     4   8.0  12.0

In [33]:
n2_df = n_df[n_df['sum']>= 8].reset_index(drop=True)

In [34]:
n2_df

   col1  col2   sum
0     2   6.0   8.0
1     3   7.0  10.0
2     4   8.0  12.0

In [2]:
# pandas 01/02
# dictionary를 dataFrame으로 변환
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'test': [45, 30, 40, 37, 48],
    'assign1': [20, 17, 22, 18, 24],
    'assign2': [19, 14, 18, 15, 25]
})

In [37]:
df

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [42]:
df1 = df['name']
print(df1)
print(df1.shape)
# 1차원배열임
print(type(df1))
print(type(df))
print(df.shape)

0    Jessica
1       Liam
2     Sophia
3       Ryan
4       Alex
Name: name, dtype: object
(5,)
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
(5, 4)

In [46]:
print(df1.to_frame())
print(type(df1.to_frame()))

df2 = df1.to_frame()
print(df2)
print(df2.shape)

      name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex
<class 'pandas.core.frame.DataFrame'>
      name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex
(5, 1)

In [47]:
# series를 dataFrame으로 변경하는 방법 2
df8 = df[['name']]
print(df8)
print(df8.shape)

      name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex
(5, 1)

In [50]:
df9 = df8.rename(columns={'name':'S_Name'})
df9

    S_Name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex

In [51]:
print(df)

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [52]:
df.rename(columns={'test':'exam'}, inplace = True)

In [53]:
df['sum'] = df['exam'] + df['assign1'] + df['assign2']
print(df)

      name  exam  assign1  assign2  sum
0  Jessica    45       20       19   84
1     Liam    30       17       14   61
2   Sophia    40       22       18   80
3     Ryan    37       18       15   70
4     Alex    48       24       25   97

In [54]:
df1 = df[['name','sum']]
print(df1)

      name  sum
0  Jessica   84
1     Liam   61
2   Sophia   80
3     Ryan   70
4     Alex   97

In [62]:
# 80점이상의 학생이름과 sum값을 출력
df2 = df[df['sum'] >= 80][['name', 'sum']]
print(df2)

      name  sum
0  Jessica   84
2   Sophia   80
4     Alex   97

In [63]:
df2.reset_index()

   index     name  sum
0      0  Jessica   84
1      2   Sophia   80
2      4     Alex   97

In [64]:
df3 = df2.reset_index(drop=True)
df3

      name  sum
0  Jessica   84
1   Sophia   80
2     Alex   97

In [69]:
df3.sort_values(by=['sum','name'], ascending=True).reset_index(drop=True)

      name  sum
0   Sophia   80
1  Jessica   84
2     Alex   97

In [70]:
df

      name  exam  assign1  assign2  sum
0  Jessica    45       20       19   84
1     Liam    30       17       14   61
2   Sophia    40       22       18   80
3     Ryan    37       18       15   70
4     Alex    48       24       25   97

In [74]:
df['grade'] = np.where(df['sum']>= 90,'A',
        np.where(df['sum'] >= 80, 'B',
                 np.where(df['sum'] >= 70, 'C', 'D' )))

In [75]:
df

      name  exam  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     D
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [78]:
df['Result'] = np.where(df['sum'] >= 80, 'Pass','Fail')
df

      name  exam  assign1  assign2  sum grade Result
0  Jessica    45       20       19   84     B   Pass
1     Liam    30       17       14   61     D   Fail
2   Sophia    40       22       18   80     B   Pass
3     Ryan    37       18       15   70     C   Fail
4     Alex    48       24       25   97     A   Pass

In [85]:
df_count= df['Result'].value_counts()
print(df_count)
print(df_count.shape)
print(type(df_count))
df_c= df_count.to_frame()
print(df_c)
print(df_c.shape)

Result
Pass    3
Fail    2
Name: count, dtype: int64
(2,)
<class 'pandas.core.series.Series'>
        count
Result
Pass        3
Fail        2
(2, 1)

In [3]:
import pandas as pd
import numpy as np

# Pandas : np.nan = null값 : not a number : NaN
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [7]:
print(df)
pd.isna(df).sum()

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

name      0
gender    2
score     1
dtype: int64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   gender  3 non-null      object
 2   score   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [9]:
df.head()

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [10]:
#숫자데이터만 통계
#df.describe()
df['score'].describe()

count     4.0000
mean     88.0000
std       9.0185
min      75.0000
25%      85.5000
50%      91.0000
75%      93.5000
max      95.0000
Name: score, dtype: float64

In [11]:
#결손데이터를 날리는 경우
clean_df= df.dropna()
clean_df

      name gender  score
0  Jessica      F   89.0
4     Alex      F   93.0

In [12]:
clean_df = df.dropna(subset=['name','score'])
clean_df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [14]:
#inplace=True 원본데이터 삭제

df.dropna(subset=['name','score'], inplace=True)
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [15]:
#reset_inedx(drop=True) 원본데이터의 row index를 clear
df.reset_index(drop=True, inplace=True)
#df.drop(columns=['Index'], inplace=True)
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Alex      F   93.0

In [16]:
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [17]:
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [23]:
df.dropna(subset=['name','score'], inplace=True)
df

   level_0  index     name gender  score
0        0      0  Jessica      F   89.0
1        1      1     Liam    NaN   75.0
2        2      2   Sophia    NaN   95.0
3        3      4     Alex      F   93.0

In [22]:
df.reset_index(inplace=True)
df

   level_0  index     name gender  score
0        0      0  Jessica      F   89.0
1        1      1     Liam    NaN   75.0
2        2      2   Sophia    NaN   95.0
3        3      4     Alex      F   93.0

In [33]:
df.drop(columns=['level_0', 'index'], inplace=True)

In [34]:
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Alex      F   93.0

In [36]:
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [37]:
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0